<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class BannersTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('banners')->delete();
        
        \DB::table('banners')->insert(array (
            0 => 
            array (
                'id' => 1,
                'name' => '{"ar":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك","en":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك"}',
                'description' => '{"ar":"رفع مستوى الوعي, المساهمة في توفير بيئة صحية لمرضى السلياك, تعزيز ودعم الأبحاث العلمية والتطويرية في مجال السلياك, دعم وتحفيز المشاريع الصغيرة بمجال السلياك .","en":"رفع مستوى الوعي, المساهمة في توفير بيئة صحية لمرضى السلياك, تعزيز ودعم الأبحاث العلمية والتطويرية في مجال السلياك, دعم وتحفيز المشاريع الصغيرة بمجال السلياك ."}',
                'is_redirect' => 1,
                'url' => 'https://www.google.com',
                'is_active' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 11:22:50',
                'updated_at' => '2024-04-22 11:22:50',
            ),
            1 => 
            array (
                'id' => 2,
                'name' => '{"ar":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك","en":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك"}',
                'description' => '{"ar":"رفع مستوى الوعي, المساهمة في توفير بيئة صحية لمرضى السلياك, تعزيز ودعم الأبحاث العلمية والتطويرية في مجال السلياك, دعم وتحفيز المشاريع الصغيرة بمجال السلياك .","en":"رفع مستوى الوعي, المساهمة في توفير بيئة صحية لمرضى السلياك, تعزيز ودعم الأبحاث العلمية والتطويرية في مجال السلياك, دعم وتحفيز المشاريع الصغيرة بمجال السلياك ."}',
                'is_redirect' => 1,
                'url' => 'https://www.google.com',
                'is_active' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 11:22:50',
                'updated_at' => '2024-04-22 11:22:50',
            ),
            2 => 
            array (
                'id' => 3,
                'name' => '{"ar":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك","en":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك"}',
                'description' => '{"ar":"رفع مستوى الوعي, المساهمة في توفير بيئة صحية لمرضى السلياك, تعزيز ودعم الأبحاث العلمية والتطويرية في مجال السلياك, دعم وتحفيز المشاريع الصغيرة بمجال السلياك .","en":"رفع مستوى الوعي, المساهمة في توفير بيئة صحية لمرضى السلياك, تعزيز ودعم الأبحاث العلمية والتطويرية في مجال السلياك, دعم وتحفيز المشاريع الصغيرة بمجال السلياك ."}',
                'is_redirect' => 1,
                'url' => 'https://www.google.com',
                'is_active' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 11:22:50',
                'updated_at' => '2024-04-22 11:22:50',
            ),
            3 => 
            array (
                'id' => 4,
                'name' => '{"ar":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك","en":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك"}',
                'description' => '{"ar":"رفع مستوى الوعي, المساهمة في توفير بيئة صحية لمرضى السلياك, تعزيز ودعم الأبحاث العلمية والتطويرية في مجال السلياك, دعم وتحفيز المشاريع الصغيرة بمجال السلياك .","en":"رفع مستوى الوعي, المساهمة في توفير بيئة صحية لمرضى السلياك, تعزيز ودعم الأبحاث العلمية والتطويرية في مجال السلياك, دعم وتحفيز المشاريع الصغيرة بمجال السلياك ."}',
                'is_redirect' => 1,
                'url' => 'https://www.google.com',
                'is_active' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 11:22:50',
                'updated_at' => '2024-04-22 11:22:50',
            ),
        ));
        
        
    }
}