<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class CommitteesTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {


        \DB::table('committees')->delete();

        \DB::table('committees')->insert(array(
//            0 =>
//                array(
//                    'id' => 1,
//                    'name' => '{"ar":"لجنة التخطيط والتطوير","en":"لجنة التخطيط والتطوير"}',
//                    'specialties_title' => '{"ar":"اختصاصات ومهام لجنة التخطيط والتطويرة","en":"اختصاصات ومهام لجنة التخطيط والتطوير"}',
//                    'description' => '{"ar":"تشكيل لجنة التخطيط والتطوير: تشكّل ــ بقرار من مجلس إدارة الجمعية ــ لجنة تسمى (لجنة التخطيط والتطوير) تتكون من ثالثة أعضاء على الأقل، على أن يكون من بينهم أحد أعضاء مجلس الإدارة، ويتم تسمية رئيس اللجنة على أن يكون من أحد أعضاء مجلس الإدارة، وله زيادة عدد أعضاء اللجنة متى ما دعت الحاجة لذلك بعد موافقة مجلس إدارة الجمعية.","en":"تختص (لجنة التخطيط والتطوير) على اقتراح سياسات ومعايير واضحة للعضوية وإعداد وصف للقدرات والمؤهلات المطلوبة لعضوية مجلس الإدارة المراجعة السنوية للاحتياجات الازمة وهيكل مجلس الإدارة والإدارة التنفيذية وإعداد سلم الرواتب لموظفي الجمعية و وضع وصف وظيفي وإجراءات خاصة في حال شغور مركز أحد أعضاء مجلس الإدارة وأيضا إجراءات المناسبة لتوفير المعلومات الوافية عن شؤون الجمعية وتحديد جوانب القوة والضعف."}',
//                    'specialties' => '{"ar":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع","en":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع"}',
//                    'tasks' => '{"ar":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>","en":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>"}',
//                    'is_active' => 1,
//                    'deleted_at' => NULL,
//                    'created_at' => '2024-04-22 11:22:49',
//                    'updated_at' => '2024-04-22 11:22:49',
//                ),
            0 =>
                array(
                    'id' => 1,
                    'name' => '{"ar":"اللجنة العلمية","en":"اللجنة العلمية"}',
                    'specialties_title' => '{"ar":"اختصاصات ومهام اللجنة العلمية","en":"اختصاصات ومهام اللجنة العلمية"}',
                    'description' => '{"ar":"تشكيل لجنة التخطيط والتطوير: تشكّل ــ بقرار من مجلس إدارة الجمعية ــ لجنة تسمى (لجنة التخطيط والتطوير) تتكون من ثالثة أعضاء على الأقل، على أن يكون من بينهم أحد أعضاء مجلس الإدارة، ويتم تسمية رئيس اللجنة على أن يكون من أحد أعضاء مجلس الإدارة، وله زيادة عدد أعضاء اللجنة متى ما دعت الحاجة لذلك بعد موافقة مجلس إدارة الجمعية.","en":"تختص (لجنة التخطيط والتطوير) على اقتراح سياسات ومعايير واضحة للعضوية وإعداد وصف للقدرات والمؤهلات المطلوبة لعضوية مجلس الإدارة المراجعة السنوية للاحتياجات الازمة وهيكل مجلس الإدارة والإدارة التنفيذية وإعداد سلم الرواتب لموظفي الجمعية و وضع وصف وظيفي وإجراءات خاصة في حال شغور مركز أحد أعضاء مجلس الإدارة وأيضا إجراءات المناسبة لتوفير المعلومات الوافية عن شؤون الجمعية وتحديد جوانب القوة والضعف."}',
                    'specialties' => '{"ar":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع","en":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع"}',
                    'tasks' => '{"ar":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>","en":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>"}',
                    'is_active' => 1,
                    'deleted_at' => NULL,
                    'created_at' => '2024-04-22 11:22:49',
                    'updated_at' => '2024-04-22 11:22:49',
                ),
            1 =>
                array(
                    'id' => 2,
                    'name' => '{"ar":"لجنة التدقيق والمراجعة الداخلية","en":"لجنة التدقيق والمراجعة الداخلية"}',
                    'specialties_title' => '{"ar":"اختصاصات ومهام لجنة التدقيق والمراجعة الداخلية","en":"اختصاصات ومهام لجنة التدقيق والمراجعة الداخلية"}',
                    'description' => '{"ar":"تشكل بقرار من الجمعية العمومية لجنة تدقيق ومراجعة من أعضاء الجمعية العمومية أو من غريهم، على أن يكون من بينهم أحد أعضاء مجلس الإدارة، ويجب ألا يقل عدد أعضاء لجنة التدقيق والمراجعة الداخلية عن ثلاثة وألا يزيد على خمسة، ويكون من بينهم أحد الخبراء في الشؤون المالية والمحاسبية.\\nتختص (لجنة التدقيق والمراجعة الداخلية) بالرقابة على أعمال الجمعية والتحقق من سلامة ونزاهة التقارير والقوائم المالية وأنظمة الرقابة الداخلية فيها.\\n","en":"تشكل بقرار من الجمعية العمومية لجنة تدقيق ومراجعة من أعضاء الجمعية العمومية أو من غريهم، على أن يكون من بينهم أحد أعضاء مجلس الإدارة، ويجب ألا يقل عدد أعضاء لجنة التدقيق والمراجعة الداخلية عن ثلاثة وألا يزيد على خمسة، ويكون من بينهم أحد الخبراء في الشؤون المالية والمحاسبية.\\nتختص (لجنة التدقيق والمراجعة الداخلية) بالرقابة على أعمال الجمعية والتحقق من سلامة ونزاهة التقارير والقوائم المالية وأنظمة الرقابة الداخلية فيها.\\n"}',
                    'specialties' => '{"ar":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع","en":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع"}',
                    'tasks' => '{"ar":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>","en":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>"}',
                    'is_active' => 1,
                    'deleted_at' => NULL,
                    'created_at' => '2024-04-22 11:22:49',
                    'updated_at' => '2024-04-22 11:22:49',
                ),
            2 =>
                array(
                    'id' => 3,
                    'name' => '{"ar":"لجنة الموارد المالية والاستثمار","en":"لجنة الموارد المالية والاستثمار"}',
                    'specialties_title' => '{"ar":"اختصاصات ومهام لجنة الموارد المالية والاستثمار","en":"اختصاصات ومهام لجنة الموارد المالية والاستثمار"}',
                    'description' => '{"ar":"تشكيل لجنة الموارد المالية والاستثمار: تشكيل بقرار من مجلس إدارة الجمعية لجنة تسمى (لجنة الموارد المالية والاستثمار)، تتكون من ثلاثة أعضاء على الأقل، على أن يكون من بينهم أحد أعضاء مجلس الإدارة، ويجب أن يتمتع الأعضاء بالخبرة والمعرفة الكافية في المسائل المالية والاستثمار.","en":"تختص (لجنة الموارد المالية والاستثمار) على الأشراف على إعداد الموازنة التقديرية للسنة المالية الجديدة للجمعية وإدارة المشاريع الاستثمارية القائمة للجمعية وتقييمها وإعداد وصياغة السياسة الاستثمارية وعرضها لمجلس الإدارة ومتابعتها وتنفيذها "}',
                    'specialties' => '{"ar":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع","en":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع"}',
                    'tasks' => '{"ar":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>","en":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>"}',
                    'is_active' => 1,
                    'deleted_at' => NULL,
                    'created_at' => '2024-04-22 11:22:49',
                    'updated_at' => '2024-04-22 11:22:49',
                ),
            3 =>
                array(
                    'id' => 4,
                    'name' => '{"ar":"لجنة إدارة المخاطر ","en":"لجنة إدارة المخاطر "}',
                    'specialties_title' => '{"ar":"اختصاصات ومهام لجنة إدارة المخاطر","en":"اختصاصات ومهام لجنة إدارة المخاطر"}',
                    'description' => '{"ar":"تشكّل ــ بقرار من مجلس إدارة الجمعية ــ لجنة تسمى (لجنة إدارة المخاطر)، تتكون من ثلاثة أعضاء على الأقل، يكون من بينهم أحد أعضاء مجلس الإدارة، على أن يتوفر في أعضائها مستوى ملائم من المعرفة في إدارة المخاطر والشؤون المالية.","en":"تختص (لجنة إدارة المخاطر) وضع استراتيجية شاملة إدارة المخاطر بما يتناسب مع طبيعة وحجم أنشطة الجمعية، والتحقق من تنفيذها ومراجعتها وتحديثها بناءً على المخاطر الداخلية والخارجية للجمعية وإعداد تقارير مفصلة حول التعرض للمخاطر والخطوات المقترحة إدارة هذه المخاطر، ورفعها لمجلس الإدارة ودراسة وتحليل المخاطر اليت قد تنشأ من تنفيذ الجمعية لبعض مشاريعها، ورفع ما تتوصل إليه لمجلس الإدارة."}',
                    'specialties' => '{"ar":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع","en":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع"}',
                    'tasks' => '{"ar":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>","en":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>"}',
                    'is_active' => 1,
                    'deleted_at' => NULL,
                    'created_at' => '2024-04-22 11:22:49',
                    'updated_at' => '2024-04-22 11:22:49',
                ),
            4 =>
                array(
                    'id' => 5,
                    'name' => '{"ar":"لجنة الجرد","en":"لجنة الجرد"}',
                    'specialties_title' => '{"ar":"اختصاصات ومهام لجنة الجرد","en":"اختصاصات ومهام لجنة الجرد"}',
                    'description' => '{"ar":"تشكّل ــ بقرار من مجلس إدارة الجمعية ــ لجنة تسمى (لجنة إدارة المخاطر)، تتكون من ثلاثة أعضاء على الأقل، يكون من بينهم أحد أعضاء مجلس الإدارة، على أن يتوفر في أعضائها مستوى ملائم من المعرفة في إدارة المخاطر والشؤون المالية.","en":"تختص (لجنة إدارة المخاطر) وضع استراتيجية شاملة إدارة المخاطر بما يتناسب مع طبيعة وحجم أنشطة الجمعية، والتحقق من تنفيذها ومراجعتها وتحديثها بناءً على المخاطر الداخلية والخارجية للجمعية وإعداد تقارير مفصلة حول التعرض للمخاطر والخطوات المقترحة إدارة هذه المخاطر، ورفعها لمجلس الإدارة ودراسة وتحليل المخاطر اليت قد تنشأ من تنفيذ الجمعية لبعض مشاريعها، ورفع ما تتوصل إليه لمجلس الإدارة."}',
                    'specialties' => '{"ar":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع","en":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع"}',
                    'tasks' => '{"ar":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>","en":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>"}',
                    'is_active' => 1,
                    'deleted_at' => NULL,
                    'created_at' => '2024-04-22 11:22:49',
                    'updated_at' => '2024-04-22 11:22:49',
                ),
            5 =>
                array(
                    'id' => 6,
                    'name' => '{"ar":"اللجنة التنفيذية","en":"اللجنة التنفيذية"}',
                    'specialties_title' => '{"ar":"اختصاصات ومهام لجنة التنفيذية","en":"اختصاصات ومهام لجنة التنفيذية"}',
                    'description' => '{"ar":"تشكيل لجنة التخطيط والتطوير: تشكّل ــ بقرار من مجلس إدارة الجمعية ــ لجنة تسمى (لجنة التخطيط والتطوير) تتكون من ثالثة أعضاء على الأقل، على أن يكون من بينهم أحد أعضاء مجلس الإدارة، ويتم تسمية رئيس اللجنة على أن يكون من أحد أعضاء مجلس الإدارة، وله زيادة عدد أعضاء اللجنة متى ما دعت الحاجة لذلك بعد موافقة مجلس إدارة الجمعية.","en":"تختص (لجنة التخطيط والتطوير) على اقتراح سياسات ومعايير واضحة للعضوية وإعداد وصف للقدرات والمؤهلات المطلوبة لعضوية مجلس الإدارة المراجعة السنوية للاحتياجات الازمة وهيكل مجلس الإدارة والإدارة التنفيذية وإعداد سلم الرواتب لموظفي الجمعية و وضع وصف وظيفي وإجراءات خاصة في حال شغور مركز أحد أعضاء مجلس الإدارة وأيضا إجراءات المناسبة لتوفير المعلومات الوافية عن شؤون الجمعية وتحديد جوانب القوة والضعف."}',
                    'specialties' => '{"ar":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع","en":"تعرف على اهم اختصاصات ومهام اللجنة العلمية التى تقدمها للعناية بمرضي السلياك والتى تمثل دور كبير فى نشر الوعي بين افراد المجتمع"}',
                    'tasks' => '{"ar":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>","en":"<li>مراجعة واعتماد المحتوى التوعوي (مطبوع – مرئي)</li> <li>مراجعة الابحاث العلمية المقدمة للجمعية ورفع توصية بالعمل بها أو تحسينها او رفضها.</li> <li>التوصية بالعمل على بحوث علمية مقترحة. <li>اعتماد الأوراق العلمية المقدمة من الجمعية في المؤتمرات ذات العلاقة.</li><li>مراجعة واعتماد المحتوى العلمي للبروشورات.</li>"}',
                    'is_active' => 1,
                    'deleted_at' => NULL,
                    'created_at' => '2024-04-22 11:22:49',
                    'updated_at' => '2024-04-22 11:22:49',
                ),
        ));

    }
}
