<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class DonationsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {


        \DB::table('donations')->delete();

        \DB::table('donations')->insert(array (
            0 =>
            array (
                'id' => 10,
                'name' => '{"ar":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له ","en":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له "}',
                'description' => '{"ar":"تبرعك يساعد فى حياة انسان","en":"تبرعك يساعد فى حياة انسان"}',
                'is_active' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 13:38:44',
                'updated_at' => '2024-04-22 13:38:44',
            ),
            1 =>
            array (
                'id' => 11,
                'name' => '{"ar":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له ","en":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له "}',
                'description' => '{"ar":"تبرعك يساعد فى حياة انسان","en":"تبرعك يساعد فى حياة انسان"}',
                'is_active' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 13:38:44',
                'updated_at' => '2024-04-22 13:38:44',
            ),
            2 =>
            array (
                'id' => 12,
                'name' => '{"ar":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له ","en":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له "}',
                'description' => '{"ar":"تبرعك يساعد فى حياة انسان","en":"تبرعك يساعد فى حياة انسان"}',
                'is_active' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 13:38:44',
                'updated_at' => '2024-04-22 13:38:44',
            ),
            3 =>
            array (
                'id' => 13,
                'name' => '{"ar":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له ","en":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له "}',
                'description' => '{"ar":"تبرعك يساعد فى حياة انسان","en":"تبرعك يساعد فى حياة انسان"}',
                'is_active' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 13:38:44',
                'updated_at' => '2024-04-22 13:38:44',
            ),
            4 =>
            array (
                'id' => 14,
                'name' => '{"ar":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له ","en":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له "}',
                'description' => '{"ar":"تبرعك يساعد فى حياة انسان","en":"تبرعك يساعد فى حياة انسان"}',
                'is_active' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 13:38:44',
                'updated_at' => '2024-04-22 13:38:44',
            ),
            5 =>
            array (
                'id' => 15,
                'name' => '{"ar":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له ","en":"أكفل طفل سلياكي وساعده بالحصول على الغذاء والشراب المناسب له "}',
                'description' => '{"ar":"تبرعك يساعد فى حياة انسان","en":"تبرعك يساعد فى حياة انسان"}',
                'is_active' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 13:38:44',
                'updated_at' => '2024-04-22 13:38:44',
            ),
        ));


    }
}
