<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class PostsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('posts')->delete();
        
        \DB::table('posts')->insert(array (
            0 => 
            array (
                'id' => 1,
                'name' => '{"ar":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك","en":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك"}',
                'description' => '{"ar":"اقامت جمعية السلياك الركن التوعوي يوم الأربعاء الموافق 2023/5/10 بمناسبة شهر السلياك العالمي في الهيئة الملكية بالسفارات كل الشكر والتقدير لـ بدر سالم القحطاني اخصائي اول التدريب والتطوير ......","en":"اقامت جمعية السلياك الركن التوعوي يوم الأربعاء الموافق 2023/5/10 بمناسبة شهر السلياك العالمي في الهيئة الملكية بالسفارات كل الشكر والتقدير لـ بدر سالم القحطاني اخصائي اول التدريب والتطوير ......"}',
                'is_active' => 1,
                'publish_date' => '2024-04-22 11:22:50',
                'user_id' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 11:22:50',
                'updated_at' => '2024-04-22 11:22:50',
            ),
            1 => 
            array (
                'id' => 2,
                'name' => '{"ar":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك","en":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك"}',
                'description' => '{"ar":"اقامت جمعية السلياك الركن التوعوي يوم الأربعاء الموافق 2023/5/10 بمناسبة شهر السلياك العالمي في الهيئة الملكية بالسفارات كل الشكر والتقدير لـ بدر سالم القحطاني اخصائي اول التدريب والتطوير ......","en":"اقامت جمعية السلياك الركن التوعوي يوم الأربعاء الموافق 2023/5/10 بمناسبة شهر السلياك العالمي في الهيئة الملكية بالسفارات كل الشكر والتقدير لـ بدر سالم القحطاني اخصائي اول التدريب والتطوير ......"}',
                'is_active' => 1,
                'publish_date' => '2024-04-22 11:22:50',
                'user_id' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 11:22:50',
                'updated_at' => '2024-04-22 11:22:50',
            ),
            2 => 
            array (
                'id' => 3,
                'name' => '{"ar":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك","en":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك"}',
                'description' => '{"ar":"اقامت جمعية السلياك الركن التوعوي يوم الأربعاء الموافق 2023/5/10 بمناسبة شهر السلياك العالمي في الهيئة الملكية بالسفارات كل الشكر والتقدير لـ بدر سالم القحطاني اخصائي اول التدريب والتطوير ......","en":"اقامت جمعية السلياك الركن التوعوي يوم الأربعاء الموافق 2023/5/10 بمناسبة شهر السلياك العالمي في الهيئة الملكية بالسفارات كل الشكر والتقدير لـ بدر سالم القحطاني اخصائي اول التدريب والتطوير ......"}',
                'is_active' => 1,
                'publish_date' => '2024-04-22 11:22:50',
                'user_id' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 11:22:50',
                'updated_at' => '2024-04-22 11:22:50',
            ),
            3 => 
            array (
                'id' => 4,
                'name' => '{"ar":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك","en":"نسعى جاهـــدين للريـــادة في تحسيـــن جودة حياة مرضى السلياك"}',
                'description' => '{"ar":"اقامت جمعية السلياك الركن التوعوي يوم الأربعاء الموافق 2023/5/10 بمناسبة شهر السلياك العالمي في الهيئة الملكية بالسفارات كل الشكر والتقدير لـ بدر سالم القحطاني اخصائي اول التدريب والتطوير ......","en":"اقامت جمعية السلياك الركن التوعوي يوم الأربعاء الموافق 2023/5/10 بمناسبة شهر السلياك العالمي في الهيئة الملكية بالسفارات كل الشكر والتقدير لـ بدر سالم القحطاني اخصائي اول التدريب والتطوير ......"}',
                'is_active' => 1,
                'publish_date' => '2024-04-22 11:22:50',
                'user_id' => 1,
                'deleted_at' => NULL,
                'created_at' => '2024-04-22 11:22:50',
                'updated_at' => '2024-04-22 11:22:50',
            ),
        ));
        
        
    }
}