<?php

use Spatie\LaravelSettings\Migrations\SettingsMigration;

return new class extends SettingsMigration
{
    public function up(): void
    {
        $this->migrator->add('about.association_about_en',
            '<h1>تسعى الجمعية لتقديم خدمات وبرامج لجميع  المستفيدين ,كما تعزز الشراكات الناجحة لتلبية حاجات المجتمع </h1> <p>رفع مستوى الوعي, المساهمة في توفير بيئة صحية لمرضى السلياك, تعزيز ودعم الأبحاث العلمية والتطويرية, و دعم وتحفيز المشاريع الصغيرة في مجال السلياك</p>',
        );
        $this->migrator->add('about.association_visions_en',
            'المساعدة فى تربيتهم بشكل طبيعي وسليم والابتعاد عن المخاطر وتقديم الدعم المعنوى فى كل الاوقات الصعبة .',
        );
        $this->migrator->add('about.establishment_of_the_association_en',
            'تأسست جمعية السلياك في عام 2018 تحت رعاية امير منطقة الرياض صاحب السمو الملكي فيصل بن بندر بن عبدالعزيز ال سعود ، وهي جمعية أهلية غير ربحية مرخصة من وزارة الموارد البشرية والتنمية الاجتماعية برقم 1050 وتحت إشراف وزارة الصحة ، وتخدم جميع مناطق المملكة . جمعية السلياك هي الجمعية الاولى في المملكة العربية السعودية لمرضى السلياك وتهدف لتوعية وارشاد المرضى وتقديم الدعم الكامل لهم',
        );
        $this->migrator->add('about.association_message_en',
            'المساعدة فى تربيتهم بشكل طبيعي وسليم والابتعاد عن المخاطر وتقديم الدعم المعنوى فى كل الاوقات الصعبة .',
        );
        $this->migrator->add('about.association_values_en',
            'المساعدة فى تربيتهم بشكل طبيعي وسليم والابتعاد عن المخاطر وتقديم الدعم المعنوى فى كل الاوقات الصعبة .',
        );
        $this->migrator->add('about.association_objectives_en',
            'المساعدة فى تربيتهم بشكل طبيعي وسليم والابتعاد عن المخاطر وتقديم الدعم المعنوى فى كل الاوقات الصعبة .',
        );

        $this->migrator->add('about.association_about_ar',
            'تأسست جمعية السلياك في عام 2018 تحت رعاية امير منطقة الرياض صاحب السمو الملكي فيصل بن بندر بن عبدالعزيز ال سعود ، وهي جمعية أهلية غير ربحية مرخصة من وزارة الموارد البشرية والتنمية الاجتماعية برقم 1050 وتحت إشراف وزارة الصحة ، وتخدم جميع مناطق المملكة . جمعية السلياك هي الجمعية الاولى في المملكة العربية السعودية لمرضى السلياك وتهدف لتوعية وارشاد المرضى وتقديم الدعم الكامل لهم',
        );

        $this->migrator->add('about.association_visions_ar',  'المساعدة فى تربيتهم بشكل طبيعي وسليم والابتعاد عن المخاطر وتقديم الدعم المعنوى فى كل الاوقات الصعبة .',
        );
        $this->migrator->add('about.establishment_of_the_association_ar',
            'تأسست جمعية السلياك في عام 2018 تحت رعاية امير منطقة الرياض صاحب السمو الملكي فيصل بن بندر بن عبدالعزيز ال سعود ، وهي جمعية أهلية غير ربحية مرخصة من وزارة الموارد البشرية والتنمية الاجتماعية برقم 1050 وتحت إشراف وزارة الصحة ، وتخدم جميع مناطق المملكة . جمعية السلياك هي الجمعية الاولى في المملكة العربية السعودية لمرضى السلياك وتهدف لتوعية وارشاد المرضى وتقديم الدعم الكامل لهم',
        );
        $this->migrator->add('about.association_message_ar',
            'المساعدة فى تربيتهم بشكل طبيعي وسليم والابتعاد عن المخاطر وتقديم الدعم المعنوى فى كل الاوقات الصعبة .');
        $this->migrator->add('about.association_values_ar',
            'المساعدة فى تربيتهم بشكل طبيعي وسليم والابتعاد عن المخاطر وتقديم الدعم المعنوى فى كل الاوقات الصعبة .',
        );
        $this->migrator->add('about.association_objectives_ar',
            'المساعدة فى تربيتهم بشكل طبيعي وسليم والابتعاد عن المخاطر وتقديم الدعم المعنوى فى كل الاوقات الصعبة .',
        );
        $this->migrator->add('about.about_image', 'uploads/about_bg.png');
    }
};
